{
  "title": "Posts",
  "content": [
    "Here I publish my thoughs, technical articles, updates and everything in between."
  ],
  "list": [
    {
      "title": "A news platform for everyone, everywhere",
      "badge": "project",
      "slug": "nearpress-journalism",
      "date": "24 November 2022",
      "devpost": "https://devpost.com/software/nearpress",
      "site": "https://nearpress.codesparks.nl",

      "intro": "I'm currently working on this decentralized news platform, where readers can directly pay journalists after reading an article.",
      "visual": {
        "title": "NearPress",
        "url": "nearpress-hero.png"
      },

      "sections": [
        {
          "content": "NearPress is a decentralized news platform. Readers can directly pay the journalists after reading an article. It's implemented using smart contract technology on the NEAR network. The articles are also stored on the InterPlanetary File System (IPFS), which makes them accessible from countries that censor the internet."
        },
        {
          "title": "Inspiration",
          "content": "I live in Europe (in The Netherlands) and when the war in Ukraine begun I started to wonder what the Russians would see on the news about the war, and what things they wouldn’t see on the news. It made me realize the importance of freedom of the press and uncensored internet. In addition to that, I noticed that during the COVID-19 pandemic some people were perceiving a growing gap between what they called ‘mainstream media’ and other media sources. I wanted to create a news platform that is accessible in all countries and that closes the gap between ‘mainstream media’ and other writers. I believe everyone is equal and every writer/journalist should be able to generate a fair income based on the quality of his work."
        },
        {
          "title": "What it does",
          "content": "On NearPress, journalists can directly publish their articles. They are free to choose any topic and they can set their own price for each article. Readers pay this price directly to the journalist after reading the article. This is implemented using smart contract technology on the NEAR network. The articles on NearPress also have content identifier (CID) on the InterPlanetary File System (IPFS), which can be used to retrieve the content from multiple IPFS nodes if your government blocks access to the normal NearPress website. China did try to block IPFS, but due to the nature of this protocol it is highly resistant to censorship. The next step in our roadmap is hosting the whole website on IPFS."
        },
        {
          "title": "How I built it",
          "content": "The front-end is build with Vue, Nuxt and Bootstrap. The smart contract is written in Javascript and deployed on the NEAR testnet using the NEAR Javascript SDK. The Sender browser extension is used to connect NEAR wallets to NearPress."
        },
        {
          "title": "Challenges I ran into",
          "content": "I ran into some React problems whilst trying to integrate the default NEAR wallet connector in my Vue app, but I found the Sender wallet was a good alternative and easier to integrate in my app."
        },
        {
          "title": "What I've learned",
          "content": "During this hackathon I learned to write smart contracts for NEAR using Javascript. I learned to use the Sender wallet, I learned about IPFS and I expanded my UX design and front-end development skills."
        },
        {
          "title": "What I'm proud of",
          "content": "I’m proud that I came very close to reaching my initial goal: I developed a news platform that is a great place for journalists to start publishing and earn a decent income whilst readers can read high-quality news articles, even if they can not afford a regular newspaper subscription, and I developed it using IPFS."
        },
        {
          "title": "What's next for NearPress",
          "content": "Hosting the website on IPFS, making the website fully production-ready by developing a solid back-end and developing a marketing strategy to attract journalists and readers."
        },
        {
          "video": {
            "caption": "Pitch video",
            "url": "nearpress.mp4"
          }
        },
        {
          "content": "I submitted this project to the NEAR Metabuild Hackathon on Devpost. Check out the submission below or visit the Nearpress website."
        }
      ]
    },
    {
      "title": "Discovering and publishing fiction novels has never been easier",
      "badge": "project",
      "slug": "fictron-stories",
      "date": "16 November 2022",
      "devpost": "https://devpost.com/software/fictron",
      "site": "https://fictron.codesparks.nl",

      "intro": "I'm currently working on this decentralized book publishing platform, where readers can directly pay writers whilst reading their books.",
      "visual": {
        "title": "Fictron",
        "url": "fictron-hero.png"
      },

      "sections": [
        {
          "content": "Fictron is a platform for fiction novels. Everyone can publish books on Fictron an everyone can read books. Unlike other platforms you don't have to pay for the books before reading, instead you pay while you read using micro-transactions implemented on the TRON network."
        },
        {
          "title": "Inspiration",
          "content": "Web3 already offers a lot of new opportunities for creatives. Artists like graphic designers and painters can now sell their NFTs on almost every crypto network. However, such web3-opportunities do not yet exist for other creatives like fiction writers. When I was younger I wanted to be writer, but I soon realized that finding a publisher can be quite difficult and that they could also force you to rewrite huge parts of your book. And even when a publisher decides to publish your book, it still can be difficult to convince potential readers to spend their money on a new book from a new writer they do not know. Fictron solves these problems using smart contract technology."
        },
        {
          "title": "What it does",
          "content": "On Fictron you can start reading as many books as you like and only pay for the pages you read using micro-transactions implemented on the TRON network. This makes it easier to discover new writers and might save you a lot of money. It’s smooth user interface, which is also optimized for usage on tablets or mobile devices, makes it easy to discover books and to publish books."
        },
        {
          "title": "How I built it",
          "content": "The front-end is build with vue and nuxt. The smart contract is written in Solidity and is deployed on the Nile testnet as well as the Shasta testnet. TronWeb is used to integrate the smart contract into the dApp and the TronLink browser extension can be used to connect your TRON wallet to Fictron."
        },
        {
          "title": "Challenges I ran into",
          "content": "The main challenge I ran into was storing data on the TRON network. Initially I developed very complex contracts that stored a lot of data on the network, but after deploying them on TRON I realized that I needed to simplify the contracts in order to be able to keep the smart contract interactions as fast as possible and to reduce the transaction fees."
        },
        {
          "title": "What I’ve learned and what I’m proud of",
          "content": "During this hackathon I learned to use the TronWeb and I got a deeper understanding of blockchain technologies. I also learned a lot about Solidity whilst writing the complex smart contracts mentioned earlier. I’m proud also that I could extend my UX and front-end skills and was able to create a clean user interface for the dApp. Without this hackathon I definitely wouldn’t have been able to learn all these things in such a short amount of time."
        },
        {
          "title": "What's next for Fictron",
          "content": "Making the app fully production-ready by developing a solid back-end and D=developing a good marketing strategy to attract writers and readers."
        },
        {
          "video": {
            "caption": "Pitch video",
            "url": "fictron.mp4"
          }
        },
        {
          "content": "I submitted this project to the TRON Season 3 Hackathon on Devpost. Check out the submission below or visit the Fictron website."
        }
      ]
    },

    {
      "title": "Meet Jambo, the cutest junior bark-end developer",
      "badge": "blog",
      "slug": "jambo-bark-end-developer",
      "date": "11 September 2022",
      "intro": "He is still a bit small, but he will become the best bark-end developer in the universe. We are very happy that he came into our lives.",
      "visual": {
        "title": "Jambo",
        "url": "jam-hero.png"
      },

      "sections": [
        {
          "content": "Since two months we have a junior bark-end developer named Jambo. He was only 9 weeks old when he started with us and it took him some days to develop his barks, but now he is a very good barker! Aside from barking he loves to be in the park and to play with other dogs. "
        },
        {
          "content": "He also loves to work on this hunting skills with his toys – especially rubber chickens – or by chasing his tail. He can already destruct some toys within minutes! In his free time he enjoys sleeping with a lot of peeing and pooping in between. ;)"
        },
        {
          "content": "Fun fact: he is a Schipperke, which is the smallest shepherd breed in the world which was previously used on ships to catch mice and other small animals. But they are also perfectly capable to assist (front-end) developers like me with their positive energy and cuteness. ;)"
        },
        {
          "content": "We are extremely happy to have him on our team! He brings us a tons of happiness & fun and he keeps us healthy by taking us on many walks each day. Jambo adds even more sparkles to Codesparks!",
          "visual": {
            "title": "Jambo 6 weeks old",
            "url": "jam-visual.png"
          }
        }
      ]
    },
    {
      "title": "Decreasing the demand for new products using Hedera Helix",
      "badge": "project",
      "slug": "helix-hedera-hackathon-2022",
      "date": "1 June 2022",
      "devpost": "https://devpost.com/software/hedera-helix",
      "site": "https://helix.codesparks.nl",

      "intro": "Learn more about why and how I created this decentralized app for the Hedera 2022 Hackathon and what I achieved with it so far.",
      "visual": {
        "title": "Hedera Helix",
        "url": "helix-hero.png"
      },

      "sections": [
        {
          "content": "From March until May 2022 I have dedicated all my spare time into building a decentralised app (dApp) for the Hedera 2022 Hackathon. The goal of this hackathon was building the next game-changing decentralized application with scalable Solidity Smart Contracts on Hedera. Although I was already a big fan of the Hedera technology, I didn't built anything on Hedera yet, nor on any other technology in the web3/decentralized area for that matter. It turned out to be an even bigger challenge than I expected, but all my hard work paid of in the end. Surprisingly, my project was judged as first place winner in the Sustainability Challenge and in the Women for Web3 Challenge! Below you can watch the pitch video and read more about the project."
        },
        {
          "title": "Where did your inspiration for this project come from?",
          "content": "The inspiration for this project came from observing my neighbors (mostly students) throwing away piles and piles of good furniture when they move out. I try to throw away and buy as little as possible and I wanted to inspire people to buy and sell more items second hand and/or to use their bought items for a longer period of time and make people more aware of how each of their choices have impact on the environment."
        },
        {
          "title": "What is the purpose of the dApp?",
          "content": "A smart contract is attached to each product in Helix. This contract contains a deposit that you pay when you buy the product. The deposit reflects the environmental impact of the materials in the product and the impact of the transportation from the production country to the store. Up to 60% of the deposit will be returned to you over time or after you sell it, 30% of the deposit is transferred to the person who buys the item second hand and 10% is donated to an environmental charity."
        },
        {
          "title": "How did you build it?",
          "content": "The front-end is build with Vue and Nuxt. The smart contracts are written in Solidity. To make the app more efficient, all data retrieved from the Hedera network is stored in a Vuex store such that most data is retrieved only once while using the app. Static data is also encoded and combined in a single string to reduce the amount of queries needed."
        },
        {
          "title": "What were the biggest challenges you ran into?",
          "content": "The main challenge I ran into was storing and retrieving data efficiently, to reduce gas fees and to ensure a smooth user experience. Furthermore, I needed to keep track of which smart contracts were created from the app. I solved this by creating another smart contract that maps user IDs to their smart contract IDs."
        },
        {
          "title": "What are you the most proud of?",
          "content": "During this hackathon I learned to write smart contracts, I learned Solidity and learned to use Hedera SDK services. I’m also proud that I could use my recently learned UX and front-end skills to create a clean user interface for the dApp, which is optimized for use on mobile devices. This was also the first time in my life that I participated in a hackathon and without this hackathon I probably wouldn’t have been able to learn all these things in such a short amount of time."
        },
        {
          "video": {
            "caption": "Pitch video",
            "url": "helix.mp4"
          }
        },
        {
          "content": "I submitted this project to the Hedera 2021 Hackathon on Devpost and won two prizes. Check out the submission below or visit the Helix website."
        }
      ]
    }
  ]
}
