{
  "title": "Posts",
  "content": [
    "Here I publish my thoughs, technical articles, updates and everything in between."
  ],
  "list": [
    {
      "title": "Meet Jambo: the new junior bark-end developer",
      "badge": "blog",
      "slug": "jambo-bark-end-developer",
      "date": "11 July 2022",
      "intro": "The best bark-end developer in the world!",
      "visual": {
        "title": "Jambo",
        "url": "jam-hero.png"
      },

      "sections": [
        {
          "content": "Since two months we have a junior bark-end developer named Jambo. He was only 9 weeks old when he started with us and it took him some days to develop his barks, but now he is a very good barker! Aside from barking he loves to be in the park and to play with other dogs. "
        },
        {
          "content": "He also loves to work on this hunting skills with his toys – especially rubber chickens – or by chasing his tail. He can already destruct some toys within minutes! In his free time he enjoys sleeping with a lot of peeing and pooping in between. ;)",
          "visual": {
            "title": "Jambo 6 weeks old",
            "url": "jam-visual.png"
          }
        },
        {
          "content": "Fun fact: he is a Schipperke, which is the smallest shepherd breed in the world which was previously used on ships to catch mice and other small animals. But they are also perfectly capable to assist (front-end) developers like me with their positive energy and cuteness. ;)"
        },
        {
          "content": "We are extremely happy to have him on our team! He brings us a tons of happiness & fun and he keeps us healthy by taking us on many walks each day. Jambo adds even more sparkles to Codesparks!",
          "visual": {
            "title": "Jambo",
            "url": "jambo.jpg"
          }
        }
      ]
    },
    {
      "title": "My project Hedera Helix won prizes in the Hedera 2022 Hackathon!",
      "badge": "blog",
      "slug": "helix-hedera-hackathon-2022",
      "date": "1 June 2022",
      "intro": "My decentralised app Hedera Helix won the in the sustainability challenge sponsored by Avery Dennison!",
      "visual": {
        "title": "Hedera Helix",
        "url": "helix-hero.png"
      },

      "sections": [
        {
          "content": "I'll write a blog post about my project here soon!"
        }
      ]
    }
  ]
}
